#include <LiquidCrystal.h>                                  // Подключение библиотеки для LCD
#include <Wire.h>                                           // Подключаем библиотеку Wire                           
#include <TimeLib.h>                                        // Подключаем библиотеку TimeLib (библиотека времени)
#include <RTClib.h>                                         // Подключаем библиотеку RTClib (библиотека для работы с датчиком реального времени)
#include <DHT.h>                                            // Библиотека для датчика dht11 (влажность и температура

/***************Задаем параметры датчика DHT: тип датчика и цифровой вход, к которому подключен датчик***************/
#define DHTTYPE DHT11
int tempPin = 7;
DHT dht(tempPin, DHTTYPE);
/********************************************************************************************************************/

/******Задаем параметры дисплея 1602 без шины I2C: пины дисплея и цифровые входы, к которым они подключены***********/
const int rs = 12, en = 11, d4 = 5, d5 = 4, d6 = 3, d7 = 2; //Порты LCD
LiquidCrystal lcd(rs, en, d4, d5, d6, d7);
/********************************************************************************************************************/

/*************************************************Пин фоторезистора**************************************************/
int photoPin = A0;
/********************************************************************************************************************/

/**************************************************Время*************************************************************/
RTC_DS1307 RTC;
/********************************************************************************************************************/

/**********************************************Символ градуса********************************************************/
byte grad[8] = {
  0b01100,
  0b10010,
  0b10010,
  0b01100,
  0b00000,
  0b00000,
  0b00000,
  0b00000
};
/********************************************************************************************************************/

int photo_val = 0;                                         // значение фоторезистора
int res;                                                   // значение фоторезистора / 4
char tm[16], dt[16];
String tmp, hmd;

void setup () {

  Serial.begin(9600);
  lcd.begin(16, 2);
  Wire.begin();

  RTC.begin();
  lcd.createChar(0, grad);
}



void loop() {
  /************************************Чтение данных с фоторезистора********************;****************************/
  photo_val = analogRead(photoPin);
  res = photo_val / 4;
  /******************************************************************************************************************/

  /************************************Чтение временых данных из RTC*************************************************/
  DateTime now = RTC.now();
  /******************************************************************************************************************/

  /*********************************Форматировка вывода даты, времени и влажности************************************/
  sprintf(dt, "%02d/%02d/%02d", now.year(), now.month(), now.day());
  sprintf(tm, "%02d:%02d:%02d", now.hour(), now.minute(), now.second());
  hmd = String(dht.readHumidity(), 0) + "%";
  /******************************************************************************************************************/

  /********************************************Вывод контента, если светло*******************************************/
  /*
    уровень света задаётся от 225-0 (темно-светло)
  */
  if (res < 150) {
    /******************************;************Вывод температуры****************************************************/
    lcd.setCursor(12, 0);
    lcd.print(dht.readTemperature(), 0);
    lcd.write(byte(0));
    lcd.print("C");
    /****************************************************************************************************************/

    /******************************************Вывод влажности*******************************************************/
    lcd.setCursor(13, 1);
    lcd.print(hmd);
    /****************************************************************************************************************/

    /*****************************************Вывод времени и даты***************************************************/
    lcd.setCursor(0, 0);
    lcd.print(tm);
    lcd.setCursor(0, 1);
    lcd.print(dt);
    /****************************************************************************************************************/
  }
  delay(1000);
  /******************************************************************************************************************/
}
